# SSD with Mobilenet v1 FPN feature extractor, shared box predictor and focal
# loss (a.k.a Retinanet).
# See Lin et al, https://arxiv.org/abs/1708.02002
# Trained on COCO, initialized from Imagenet classification checkpoint

# Achieves 29.7 mAP on COCO14 minival dataset.

# This config is TPU compatible

model {
  ssd {
    inplace_batchnorm_update: true
    freeze_batchnorm: false
    num_classes: <replace_num_classes>
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    encode_background_as_zeros: true
    anchor_generator {
      multiscale_anchor_generator {
        min_level: <replace_anchor_generator_min_level>
        max_level: <replace_anchor_generator_max_level>
        anchor_scale: <replace_anchor_generator_scale>
        aspect_ratios: <replace_anchor_generator_aspect_ratios>
        scales_per_octave: <replace_anchor_generator_scales_per_octave>
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 640
        width: 640
      }
    }
    box_predictor {
      weight_shared_convolutional_box_predictor {
        depth: 256
        class_prediction_bias_init: -4.6
        use_dropout: <replace_use_dropout>
        dropout_keep_probability: <replace_dropout_keep_probability>
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: <replace_l2_regularizer_weight>
            }
          }
          initializer {
            random_normal_initializer {
              stddev: 0.01
              mean: 0.0
            }
          }
          batch_norm {
            scale: true,
            decay: 0.997,
            epsilon: 0.001,
          }
        }
        num_layers_before_predictor: 4
        kernel_size: 3
      }
    }
    feature_extractor {
      type: 'ssd_mobilenet_v1_fpn'
      fpn {
        min_level: <replace_fpn_min_level>
        max_level: <replace_fpn_max_level>
      }
      min_depth: 16
      depth_multiplier: 1.0
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: <replace_l2_regularizer_weight>
          }
        }
        initializer {
          random_normal_initializer {
            stddev: 0.01
            mean: 0.0
          }
        }
        batch_norm {
          scale: true,
          decay: 0.997,
          epsilon: 0.001,
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    loss {
      classification_loss {
        weighted_sigmoid_focal {
          alpha: 0.25
          gamma: 2.0
        }
      }
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    normalize_loc_loss_by_codesize: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: <replace_max_detections_per_class>
        max_total_detections: <replace_max_detections_per_class>
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  fine_tune_checkpoint: "<replace_path>models/model/train/model.ckpt"
  batch_size: <replace_batch_size>
  sync_replicas: true
  startup_delay_steps: 0
  replicas_to_aggregate: 8
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_vertical_flip {
    }
  }
  data_augmentation_options {
    random_rotation90 {
    }
  }
  data_augmentation_options {
    random_crop_image {
      min_object_covered: 0.0
      min_aspect_ratio: 0.75
      max_aspect_ratio: 3.0
      min_area: 0.75
      max_area: 1.0
      overlap_thresh: 0.0
    }
  }
  data_augmentation_options {
    random_patch_gaussian {
      min_patch_size: <replace_patch_gaussian_min_patch_size>
      max_patch_size: <replace_patch_gaussian_max_patch_size>
      max_gaussian_stddev: <replace_patch_gaussian_max_stddev>
    }
  }
  optimizer {
    rms_prop_optimizer: {
      learning_rate: {
        exponential_decay_learning_rate {
          initial_learning_rate: <replace_initial_learning_rate>
          decay_steps: <replace_decay_steps>
          decay_factor: <replace_decay_factor>
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
    use_moving_average: false
  }
  max_number_of_boxes: <replace_max_detections_per_class>
  unpad_groundtruth_tensors: false
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "<replace_path>data/train.record-?????-of-<replace_num_train_records>"
  }
  label_map_path: "<replace_path>data/label_map.pbtxt"
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  num_examples: <replace_num_eval_examples>
  max_evals: 10
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "<replace_path>data/test.record-?????-of-<replace_num_test_records>"
  }
  label_map_path: "<replace_path>data/label_map.pbtxt"
  shuffle: false
  num_readers: 1
}
