# Mask RCNN with Inception V2
# Using ADAM Optimizer

model {
  faster_rcnn {
    number_of_stages: 3
    num_classes: <replace_num_classes>
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 800
        max_dimension: 1365
      }
    }
    feature_extractor {
      type: "faster_rcnn_inception_v2"
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: <replace_l2_regularizer_weight>
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: <replace_l2_regularizer_weight>
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: <replace_use_dropout>
        dropout_keep_probability: <replace_dropout_keep_probability>
        conv_hyperparams {
          op: CONV
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.01
            }
          }
        }
        predict_instance_masks: true
        mask_prediction_conv_depth: 0
        mask_height: 15
        mask_width: 15
        mask_prediction_num_conv_layers: 2
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 300
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
    second_stage_mask_prediction_loss_weight: 4.0
  }
}
train_config {
  batch_size: <replace_batch_size>
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: 0.0002
          schedule {
            step: 900000
            learning_rate: .00002
          }
          schedule {
            step: 1200000
            learning_rate: .000002
          }
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "<replace_path>models/model/train/model.ckpt"
  from_detection_checkpoint: true
}
train_input_reader {
  label_map_path: "<replace_path>data/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "<replace_path>data/train.record-?????-of-00001"
  }
  load_instance_masks: true
  mask_type: PNG_MASKS
}
eval_config {
  num_examples: <replace_num_eval_examples>
  max_evals: 10
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "<replace_path>data/label_map.pbtxt"
  shuffle: false
  num_readers: 1
  load_instance_masks: true
  mask_type: PNG_MASKS
  tf_record_input_reader {
    input_path: "<replace_path>data/test.record-?????-of-00001"
  }
}
